In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': 'abc def ghi xyz'.split()
})

df.head() # like head command lol

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
# get unique values in col as np array
uniq = df['col2'].unique()

In [5]:
# get amt of unique vals from its len
len(uniq)

3

In [6]:
# ...or using .nunique
df['col2'].nunique()

3

In [7]:
# grab ocurrences of each individual val
df['col2'].value_counts() # given back as pandas series...

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [9]:
# query col1; isolate rows where the condition is true
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [13]:
# we can use .apply to apply functions to a col
def fac(x):
    if (x == 0):
        return 1
    return x * fac(x - 1) # lmao fac makes nums too large

# this produces vals of a reasonable size :D
def add3(x):
    return x + 3

df['col2'].apply(add3) # this .apply is actually fire af

0    447
1    558
2    669
3    447
Name: col2, dtype: int64

In [17]:
# as u imagined its peak w anonymous funcs
df['col1'].apply(lambda x: x + 3)

0    4
1    5
2    6
3    7
Name: col1, dtype: int64

In [20]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [22]:
df.columns # get col names

Index(['col1', 'col2', 'col3'], dtype='object')

In [23]:
df.index # get index info

RangeIndex(start=0, stop=4, step=1)

In [25]:
# useful ahh sorting function from small to large top to btm
# index stays attached to row!
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [26]:
df.isnull() # check for nullvals

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [ ]:
# pivot table
# no example shown here because its kinda gnarly
# but it allows us to 'rotate' tables (swap rows for cols etc)

# KEY TAKEAWAY: be aware of it! use it when needed